src/main/resources/xml/accommodationFulfillmentServicePort/checkIn/checkIn.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:acc="http://accommodation.transferobject.fulfillment.lodging.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <acc:checkIn>
         <request>
            <!--Optional:-->
            <sameRoomNumberAssigned>?</sameRoomNumberAssigned>
            <!--Optional:-->
            <travelComponentGroupingId>?</travelComponentGroupingId>
            <!--Optional:-->
            <massCheckInIndicator>?</massCheckInIndicator>
            <!--Optional:-->
            <inventoryOverrideContact>?</inventoryOverrideContact>
            <!--Optional:-->
            <inventoryOverrideReason>?</inventoryOverrideReason>
            <!--Optional:-->
            <freezeId>?</freezeId>
            <!--Optional:-->
            <locationId>?</locationId>
            <!--Optional:-->
            <overrideRoomAssignment>?</overrideRoomAssignment>
            <!--Zero or more repetitions:-->
            <checkInGuestDetails>
               <!--Optional:-->
               <guestId>?</guestId>
               <!--Optional:-->
               <active>?</active>
            </checkInGuestDetails>
            <!--Optional:-->
            <isRequestFromSCI>?</isRequestFromSCI>
         </request>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </acc:checkIn>
   </soapenv:Body>
</soapenv:Envelope>
